_posts/2021-04-20-musing-while-walking.html
---
date: 2021-04-20 16:02
author: mzimmerm
layout: post
title: Musing while walking
excerpt: These days, I am walking a lot. Of course, walking is the most productive thinking and fun time. But walk thinking is elusive. This series is here "for myself only" - to frame those walk thoughts, preserve them for potentially getting back to them later, or simply not to forget what was already thought through. 
tags: 
- math
- walk-musings
- combinatorics
categories: 
- category-math
- category-walk-musings
- category-combinatorics
---

<div id="outline-container-org2129f76" class="outline-2">
<h2 id="org2129f76">A memory cache for walking and thinking</h2>
<div class="outline-text-2" id="text-org2129f76">
<p>
These days, I am walking a lot. Of course, walking is the most productive thinking and fun time. But walk thinking is elusive. This series is here "for myself only" - to frame those walk thoughts, preserve them for potentially getting back to them later, or simply not to forget what was already thought through.
</p>
</div>
</div>
